########################################################################
# Formality Verification Script generated by:
#     fm_mk_script -o ./scripts/rtl2syn.tcl "../syn/outputs/CHIP_TOP.svf"
# Formality (R)  Version L-2016.03-SP1 -- Apr 13, 2016
# Copyright (C) 2007-2010 Synopsys, Inc. All rights reserved.
########################################################################

########################################################################
# Synopsys Auto Setup Mode
########################################################################

set synopsys_auto_setup true

# Note: The Synopsys Auto Setup mode is less conservative than the
# Formality default mode, and is more likely to result in a successful
# verification out-of-the-box.
#
# Setting synopsys_auto_setup will change the values of the variables
# listed here below.  You may change any of these variables back to
# their default settings to be more conservative.  Uncomment the
# appropriate lines below to revert back to their default settings:

      # set hdlin_ignore_parallel_case true
      # set hdlin_ignore_full_case true
      # set verification_verify_directly_undriven_output true
      # set hdlin_ignore_embedded_configuration false
      # set svf_ignore_unqualified_fsm_information true

########################################################################
# Setup for instantiated or function-inferred DesignWare components
########################################################################

set hdlin_dwroot /opt/synopsys/dc_2018

########################################################################
# Search path
########################################################################

set search_path " \
	/project/designkit/TSMC_90/aci/sc-x/synopsys \
	/project/designkit/TSMC_90/aci/sc-x/symbols \
	/project/designkit/TSMC_90/aci/sc-x/libsi \
	/project/designkit/TSMC_90/aci/sc-x/libspm \
	/project/CK_Riscv/libs/DP_SRAM \
	/project/CK_Riscv/backend/syn/./ \
	/project/designkit/TSMC_90/aci/sc-x/symbols/synopsys "

########################################################################
# Read in the SVF file(s)
########################################################################

set_svf ../syn/outputs/CHIP_TOP.svf

########################################################################
# Read in the libraries
########################################################################

read_db -technology_library SRAM_4096_32_ff_1.1_125.0_syn.db
read_db -technology_library slow.db


########################################################################
########################################################################

# set link_library " \
	* \
	/opt/synopsys/dc_2018/libraries/syn/dw_foundation.sldb \
	SRAM_4096_32_ff_1.1_125.0_syn.db \
	slow.db "

########################################################################
# Read in the Reference Design as verilog/vhdl source code
########################################################################

# No guide_environment analyze commands found in SVF

read_verilog -r  \
  ../../module/riscv_core/rtl_v00/imm_gen.v

read_verilog -r  \
  ../../module/riscv_core/rtl_v00/alu_ctrl.v

read_verilog -r  \
  ../../module/riscv_core/rtl_v00/foward_unit.v

read_verilog -r  \
  ../../module/riscv_core/rtl_v00/hazard_detec.v

read_verilog -r  \
  ../../module/riscv_core/rtl_v00/alu_ex.v

read_verilog -r  \
  ../../module/riscv_core/rtl_v00/alu_add.v

read_verilog -r  \
  ../../module/riscv_core/rtl_v00/regfile.v

read_verilog -r  \
  ../../module/riscv_core/rtl_v00/mem_wb.v

read_verilog -r  \
  ../../module/riscv_core/rtl_v00/if_id.v

read_verilog -r  \
  ../../module/riscv_core/rtl_v00/main_ctrl.v

read_verilog -r  \
  ../../module/riscv_core/rtl_v00/ex_mem.v

read_verilog -r  \
  ../../module/riscv_core/rtl_v00/id_ex.v

read_verilog -r  \
  ../../module/riscv_core/rtl_v00/mux2.v

read_verilog -r  \
  ../../module/riscv_core/rtl_v00/mux3.v

read_verilog -r  \
  ../../module/riscv_core/rtl_v00/riscv_core.v

read_verilog -r  \
  ../../module/wrap/rtl_v00/wrap_dram.v

read_verilog -r  \
  ../../module/wrap/rtl_v00/wrap_iram.v

read_verilog -r  \
	../../module/chip/rtl_v00/CHIP_TOP.v

# USER INTERVENTION REQUIRED HERE:
set_top CHIP_TOP


########################################################################
# Read in the Implementation Design created from DC
#
# Choose the file that you wish to verify
########################################################################

# USER INTERVENTION REQUIRED HERE:
# read_ddc -i /project/CK_Riscv/backend/syn/./outputs/CHIP_TOP_post_dc.ddc
read_verilog -i /project/CK_Riscv/backend/syn/./outputs/CHIP_TOP_post_dc.v
# USER INTERVENTION REQUIRED HERE:
set_top CHIP_TOP

########################################################################
# Verify and Report
#
# If the verification is not successful, the session will be saved and reports
# will be generated to help debug the failed or inconclusive verification.
########################################################################

if { ![verify] } {
  set DESIGN_NAME                   "CHIP_TOP"  ;#  The name of the top-level design
  set FMRM_FAILING_SESSION_NAME     ${DESIGN_NAME}
  set FMRM_FAILING_POINTS_REPORT    ${DESIGN_NAME}.fmv_failing_points.rpt
  set FMRM_ABORTED_POINTS_REPORT    ${DESIGN_NAME}.fmv_aborted_points.rpt

  set REPORTS_DIR "reports"

  file mkdir ${REPORTS_DIR}

  save_session -replace ${REPORTS_DIR}/${FMRM_FAILING_SESSION_NAME}
  report_failing_points > ${REPORTS_DIR}/${FMRM_FAILING_POINTS_REPORT}
  report_aborted > ${REPORTS_DIR}/${FMRM_ABORTED_POINTS_REPORT}
}

exit
